Laetelus/ESP32_Flight_Controller/FC/src/main.cpp
#include <Arduino.h>
#include <ESP32Servo.h>
#include "I2Cdev.h"
#include "MPU6050.h"
#include <EEPROM.h>
#include "Flight_Controller.h"
#include "Calibration.h"
#include "PID_Webserver.h"
#include <WiFi.h>
#include "IMU.h"
#include "Motors.h"
#include "PID.h"
#include "PID_Webserver.h"  

IMU imu;
Motors mot; 
PID pid;
FC fc(imu, pid, mot);
Calibration cal(imu);
PID_Webserver ws(fc, pid);

static unsigned long loop_timer;
static unsigned long print_timer;

void setup()
{
  Serial.begin(921600);
  pinMode(2, OUTPUT);

  fc.initialize_FC();
  ws.initSPIFFS();

  if (!ws.loadPIDValues())
  {
    Serial.println("No PID values loaded from SPIFFS. Using default values.");
  }

  WiFi.mode(WIFI_STA);
  ws.Wifi_task();

  loop_timer = micros();
}

void loop()
{
  // TODO: Replace loop() + busy-wait with an RTOS task (xTaskCreatePinnedToCore)
  // pinned to Core 1, using vTaskDelayUntil() for precise 250Hz timing.
  // WiFi/webserver can stay on Core 0, avoiding interference with flight control.
  // static unsigned long loop_timer = micros(); // Initialize loop timer
  unsigned long current_time;

  fc.run();

  // Measure control loop time immediately — before print so serial I/O
  // doesn't count against the 4ms budget.
  current_time = micros();

  if (current_time - loop_timer > 4000)
  {
    digitalWrite(2, HIGH);
    delay(100);
    digitalWrite(2, LOW);
    delay(100);
  }

  // Busy-wait for remainder of 4ms slot.
  while (micros() - loop_timer < 4000)
    ;

  loop_timer = micros();

  // Print diagnostics after the timing window — never affects loop measurement.
  // 100ms interval = 10Hz.
  if (millis() - print_timer >= 100)
  {
    print_timer = millis();
    fc.print();
  }
}
